{
    "workExperience": [
      {
        "title": "Digital Marketing Intern",
        "company": "Indian Institute of Digital Education (IIDE)",
        "duration": "Sep 1, 2023 - Oct 19, 2023",
        "responsibilities": [
          "Trained in Google Workspace Management.",
          "Completed two case studies about Chipotle and Walmart.",
          "Executed an Instagram campaign to promote a product page and presented the marketing plan to supervisor Shreya Ravaria.",
          "Attended 20+ sessions on SEO, social media marketing, content writing, and blogging."
        ]
      },
      {
        "title": "Video Editing Intern",
        "company": "Youth School for Social Entrepreneurs (YSSE)",
        "duration": "Aug 10, 2023 - Dec 25, 2023",
        "responsibilities": [
          "Created 25 videos on topics such as climate change, leadership, car rental services, and world important days.",
          "Increased YouTube and Facebook engagement by 3%.",
          "Boosted revenue for a Rental Car Service by 2%.",
          "Attended 60+ sessions on networking, entrepreneurship, hard & soft skills, public speaking, project management, and email etiquette.",
          "Nominated as the best intern of batch 9.0.",
          "Completed the internship with distinction, achieving a 95% grade."
        ]
      },
      {
        "title": "Campus Ambassador Intern",
        "company": "International Model United Nations (IMUN)",
        "duration": "Sep 1, 2021 - Jan 1, 2022",
        "responsibilities": [
          "Promoted IMUN online conferences among peers and in 5 universities to increase registrations.",
          "Motivated peers to join IMUN online conferences through Zoom meetings.",
          "Recognized 5 times as the best task winner of the week."
        ]
      },
      {
        "title": "Internship at BFRI",
        "company": "Bangladesh Fisheries Research Institute",
        "duration": "Jul 1, 2024 - Aug 1, 2024",
        "responsibilities": [
          "Conducted carp breeding (Rui, Catla, Mrigel).",
          "Conducted breeding of SIS (Small Indigenous Species) species Sarpunti.",
          "Diagnosed diseases in fish species such as Tilapia, Shingi, and Pabda.",
          "Performed DNA extraction, PCR, and Gel Electrophoresis.",
          "Produced rice, nucleus, and image pearls from freshwater mussels."
        ]
      },
      {
        "title": "Externship at UMT",
        "company": "Universiti Malaysia Terengganu",
        "duration": "Aug 7, 2024 - Sep 9, 2024",
        "responsibilities": [
          "Prepared various types of fishing nets and knots.",
          "Developed a new fish product named Fish Ricos from Otoshimi.",
          "Created GIS mapping of suitable fishing zones in Malaysia.",
          "Prepared Malaysian local cuisine such as Keropok lekor and Fish satar."
        ]
      }
    ]
  }